# Description Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalDefinition..::..Description Property
ExternalDefinition Class See Also
---
The description of the parameter. The description will be used as tooltip in the Revit UI including in the properties palette.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public virtual string Description { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property Description As String
	Get
```

Visual C++
---
```text
public:
virtual property String^ Description {
	String^ get ();
}
```

# See Also
ExternalDefinition Class
Autodesk.Revit.DB Namespace